performance-test-reports/automated-security-tests/12593925737/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2025-01-03T06:49:32Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 326375 / ✗ 6591
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 1941
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1329
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3321

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 326375 / ✗ 6591
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 326375 / ✗ 6591
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6591    7.434154/s
-    _response_success_cnt..........: 326375  368.126533/s
-    _response_total_cnt............: 332966  375.560687/s
-    checks.........................: 99.33%  ✓ 3942864     ✗ 26364 
-    data_received..................: 117 MB  132 kB/s
-    data_sent......................: 78 MB   88 kB/s
-    dropped_iterations.............: 1629063 1837.460942/s
-    group_duration.................: avg=931.57ms min=236.19µs med=2.57ms   max=1m1s     p(90)=1.28s    p(95)=2.51s   
-    http_req_blocked...............: avg=471.18ms min=0s       med=181.72µs max=19.59s   p(90)=1.03s    p(95)=2.05s   
-    http_req_connecting............: avg=471.11ms min=0s       med=141.49µs max=19.59s   p(90)=1.03s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.26s    min=0s       med=254.63ms max=1m0s     p(90)=749.38ms p(95)=1.6s    
-      { expected_response:true }...: avg=547.12ms min=992.41µs med=254.23ms max=58.52s   p(90)=670.71ms p(95)=1.21s   
-  ✗ http_req_failed................: 1.97%   ✓ 6591        ✗ 326375
-    http_req_receiving.............: avg=994.77µs min=0s       med=89.01µs  max=274.1ms  p(90)=1.28ms   p(95)=2.84ms  
-    http_req_sending...............: avg=646.88µs min=0s       med=35.5µs   max=251.53ms p(90)=196.4µs  p(95)=645.09µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.26s    min=0s       med=253.98ms max=1m0s     p(90)=743.64ms p(95)=1.6s    
-    http_reqs......................: 332966  375.560687/s
-    iteration_duration.............: avg=1.86s    min=3.27ms   med=262.38ms max=1m1s     p(90)=2.51s    p(95)=5.35s   
-    iterations.....................: 332966  375.560687/s
-    vus............................: 1       min=0         max=1000
-    vus_max........................: 1000    min=468       max=1000